<?php

use Illuminate\Contracts\Http\Kernel;
use Illuminate\Http\Request;

define('LARAVEL_START', microtime(true));

/*
|--------------------------------------------------------------------------
| アプリケーションがメンテナンス中かどうかの確認
|--------------------------------------------------------------------------
|
| アプリケーションが「down」コマンドによるメンテナンス／デモモードにある場合、
| フレームワークを起動する（例外が発生する可能性がある）代わりに、
| 事前にレンダリングされたコンテンツを表示できるように、このファイルを読み込みます。
|
*/

if (file_exists($maintenance = __DIR__.'/../storage/framework/maintenance.php')) {
    require $maintenance;
}

/*
|--------------------------------------------------------------------------
| オートローダーの登録
|--------------------------------------------------------------------------
|
| Composerは、このアプリケーションのために便利で自動生成されたクラスローダーを
| 提供しています。ここで単純に
| スクリプトにそれをrequireし、クラスを手動でロードする必要がないようにします。
|
*/

require __DIR__.'/../vendor/autoload.php';

/*
|--------------------------------------------------------------------------
| アプリケーションの実行
|--------------------------------------------------------------------------
|
| アプリケーションが用意できたら、アプリケーションのHTTPカーネルを使用して
| 受け取ったリクエストを処理します。その後、このクライアントのブラウザに
| レスポンスを送り、アプリケーションを楽しんでもらいます。
|
*/

$app = require_once __DIR__.'/../bootstrap/app.php';

$kernel = $app->make(Kernel::class);

$response = $kernel->handle(
    $request = Request::capture()
)->send();

$kernel->terminate($request, $response);