<?php

use Illuminate\Support\Str;

return [

    /*
    |--------------------------------------------------------------------------
    | デフォルトのセッションドライバ
    |--------------------------------------------------------------------------
    |
    | このオプションは、リクエストで使用されるデフォルトのセッション「ドライバ」を制御します。
    | デフォルトでは、軽量な「ネイティブ」（ファイル）ドライバを使用しますが、
    | ここで提供されている他の素晴らしいドライバを指定することもできます。
    |
    | サポートされているドライバ: "file", "cookie", "database", "apc",
    |                           "memcached", "redis", "dynamodb", "array"
    |
    */

    'driver' => env('SESSION_DRIVER', 'file'),

    /*
    |--------------------------------------------------------------------------
    | セッションの有効期間（Lifetime）
    |--------------------------------------------------------------------------
    |
    | ここでは、セッションが期限切れになるまでにアイドル（操作がない）状態でいられる
    | 時間（分）を指定できます。ブラウザを閉じたときに即座に期限切れにしたい場合は、
    | そのオプション（'expire_on_close'）を設定してください。
    |
    */

    'lifetime' => env('SESSION_LIFETIME', 120),

    'expire_on_close' => false,

    /*
    |--------------------------------------------------------------------------
    | セッションの暗号化
    |--------------------------------------------------------------------------
    |
    | このオプションを有効にすると、セッションに保存されるすべてのデータが、
    | 格納される前に暗号化されるように指定できます。すべての暗号化はLaravelによって
    | 自動的に実行され、通常通りセッションを使用できます。
    |
    */

    'encrypt' => false,

    /*
    |--------------------------------------------------------------------------
    | セッションファイルの場所
    |--------------------------------------------------------------------------
    |
    | ネイティブなセッションドライバ（'file'）を使用する場合、セッションファイルを
    | 格納する場所が必要です。デフォルトの場所が設定されていますが、別の場所を
    | 指定することもできます。これはファイルセッションにのみ必要です。
    |
    */

    'files' => storage_path('framework/sessions'),

    /*
    |--------------------------------------------------------------------------
    | セッション用のデータベース接続
    |--------------------------------------------------------------------------
    |
    | 「database」または「redis」セッションドライバを使用する場合、これらの
    | セッションを管理するために使用される接続を指定できます。これは、
    | データベース設定オプション内の接続と一致する必要があります。
    |
    */

    'connection' => env('SESSION_CONNECTION'),

    /*
    |--------------------------------------------------------------------------
    | セッション用のデータベーステーブル
    |--------------------------------------------------------------------------
    |
    | 「database」セッションドライバを使用する場合、セッションの管理に使用する
    | テーブルを指定できます。もちろん、適切なデフォルト値が提供されていますが、
    | 必要に応じて自由に変更できます。
    |
    */

    'table' => 'sessions',

    /*
    |--------------------------------------------------------------------------
    | セッションキャッシュストア
    |--------------------------------------------------------------------------
    |
    | フレームワークのキャッシュ駆動型セッションバックエンドのいずれかを使用する際、
    | これらのセッションに使用すべきキャッシュストアをリストできます。この値は、
    | アプリケーションで設定されているキャッシュ「ストア」のいずれかと
    | 一致する必要があります。
    |
    | 影響を受けるドライバ: "apc", "dynamodb", "memcached", "redis"
    |
    */

    'store' => env('SESSION_STORE'),

    /*
    |--------------------------------------------------------------------------
    | セッション破棄の抽選（Lottery）
    |--------------------------------------------------------------------------
    |
    | 一部のセッションドライバは、ストレージから古いセッションを取り除くために、
    | 手動でストレージ場所を破棄（sweep）する必要があります。ここでは、それが
    | 特定のリクエストで発生する確率を設定します。デフォルトでは、確率は
    | 100分の2です。
    |
    */

    'lottery' => [2, 100],

    /*
    |--------------------------------------------------------------------------
    | セッションクッキー名
    |--------------------------------------------------------------------------
    |
    | ここでは、セッションインスタンスをIDで識別するために使用されるクッキーの
    | 名前を変更できます。ここで指定された名前は、フレームワークによって新しい
    | セッションクッキーが作成されるたびに、すべてのドライバで使用されます。
    |
    */

    'cookie' => env(
        'SESSION_COOKIE',
        Str::slug(env('APP_NAME', 'laravel'), '_').'_session'
    ),

    /*
    |--------------------------------------------------------------------------
    | セッションクッキーのパス
    |--------------------------------------------------------------------------
    |
    | セッションクッキーのパスは、クッキーが利用可能であると見なされるパスを決定します。
    | 通常はアプリケーションのルートパスになりますが、必要に応じて自由に変更できます。
    |
    */

    'path' => '/',

    /*
    |--------------------------------------------------------------------------
    | セッションクッキーのドメイン
    |--------------------------------------------------------------------------
    |
    | ここでは、アプリケーションでセッションを識別するために使用されるクッキーの
    | ドメインを変更できます。これにより、アプリケーション内のどのドメインで
    | クッキーが利用可能になるかが決まります。適切なデフォルト値が設定されています。
    |
    */

    'domain' => env('SESSION_DOMAIN'),

    /*
    |--------------------------------------------------------------------------
    | HTTPS 専用クッキー
    |--------------------------------------------------------------------------
    |
    | このオプションを true に設定すると、セッションクッキーはブラウザが HTTPS 接続を
    | 使用している場合にのみサーバーに送り返されます。これにより、安全でない方法で
    | 送信できない場合にクッキーが送信されるのを防ぎます。
    |
    */

    'secure' => env('SESSION_SECURE_COOKIE'),

    /*
    |--------------------------------------------------------------------------
    | HTTP アクセスのみ
    |--------------------------------------------------------------------------
    |
    | この値を true に設定すると、JavaScriptがクッキーの値にアクセスするのを防ぎ、
    | クッキーは HTTP プロトコルを通じてのみアクセス可能になります。
    | 必要に応じてこのオプションを修正できます。
    |
    */

    'http_only' => true,

    /*
    |--------------------------------------------------------------------------
    | Same-Site クッキー
    |--------------------------------------------------------------------------
    |
    | このオプションは、クロスサイトリクエストが発生したときのクッキーの動作を決定し、
    | CSRF攻撃を軽減するために使用できます。デフォルトでは、安全なデフォルト値である
    | 「lax」に設定されます。
    |
    | サポートされている値: "lax", "strict", "none", null
    |
    */

    'same_site' => 'lax',

    /*
    |--------------------------------------------------------------------------
    | 分割されたクッキー（Partitioned Cookies）
    |--------------------------------------------------------------------------
    |
    | この値を true に設定すると、クロスサイトのコンテキストにおいて、クッキーが
    | トップレベルのサイトに結び付けられます。分割されたクッキーは、
    | 「secure」フラグが設定され、「Same-Site」属性が「none」に設定されている場合に、
    | ブラウザによって受け入れられます。
    |
    */

    'partitioned' => false,

];
